<template>
    <section>
        <fieldset>
            <legend>单行省略号</legend>
            <div style="width: 100%; box-sizing: border-box;" class="czw-text-ellipsis">
                2019年10月30日，国家烟草专卖局、国家市场监督管理总局发布《关于进一步保护未成年人免受电子烟侵害的通告》（附件一），敦促电商平台及时关闭电子烟店铺，并将电子烟产品及时下架。2019年11月6日，根据该通知要求，浙江省烟草专卖局《关于立即关闭电子烟店铺、下架电子烟产品的函》（附件二），要求阿里巴巴集团即日起关闭平台上电子烟店铺，并将电子烟产品及时下架。

                呵护未成年人身心健康，是阿里巴巴一以贯之的准则。为了保护未成年人免受电子烟侵害，阿里巴巴一直都严格要求任何店铺不得以任何形式向未成年人出售电子烟产品，禁止电子烟类产品以未成年人或者学生群体为营销推荐对象，禁止在宣传信息中出现含有学生、学校、少年儿童等文字、图片的素材内容。此外，阿里巴巴也早已在全网电子烟产品页面增加了未满18岁群体的购买劝阻信息，并上线电子烟交易拦截功能，识别并阻断18岁以下消费群体购买电子烟的通道。

                阿里巴巴始终严格遵守国家有关政策和法律法规。为了配合国家有关部门针对电子烟的监管要求，平台从即日起下架电子烟相关产品、禁止电子烟相关产品的销售及广告投放，同时做好商家咨询及消费者售后保障服务，感谢广大商家理解并支持。
            </div>
        </fieldset>
    </section>
</template>

<script>
    export default {
        name: "TextExamples"
    }
</script>

<style scoped lang="scss">
    @import "~@scss/index";
</style>